app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Hippie"], ["color", "Calico"], ["created_at", "2020-01-04 17:46:27.411053"], ["updated_at", "2020-01-04 17:46:27.411053"]]
---
   def create
     @cat = Cat.new(post_params(:name, :color))
     @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["color", "green"], ["updated_at", "2020-01-04 18:03:44.589400"], ["id", 1]]
---
   def update
     @cat = Cat.find(params[:id])
     @cat.update(cat_params(:color))